#
# .zsh_plugins.txt - antidote plugins file
#

#
# Zephyr
#

using:mattmc3/zephyr path:plugins
environment
homebrew conditional:is-macos
history
color
directory
utility
editor
#zfunctions
macos conditional:is-macos

#
# Hooks
#

zsh-hooks/zsh-hooks

#
# Completions
#

mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath path:src

#
# Editor
#

jeffreytse/zsh-vi-mode
romkatv/zsh-no-ps2

#
# Prompts
#

# sindresorhus/pure kind:fpath
# miekg/lean kind:fpath
# mattmc3/zephyr path:plugins/prompt
romkatv/powerlevel10k

#
# Custom
#

using:mattmc3/zsh_custom path:plugins
mattmc3/zsh_custom autoload:functions
azure
clipboard
common-aliases
common-functions
direnv
dotfiles
dotnet
extract
git
git-cmds
gpg
iwd
jupyter
perl
prj
python
ruby
sqlite
terminal
zoxide

#
# Utils
#

romkatv/zsh-bench kind:path
# aloxaf/fzf-tab
mattmc3/zman

#
# Final
#

zdharma-continuum/fast-syntax-highlighting
zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search post:bindkey-hss

# vi: ft=properties
