#mattmc3/zebrafish
zshzoo/environment
zshzoo/setopts
zshzoo/history
zshzoo/completion-zstyles
zshzoo/keybindings
zshzoo/magic-enter
zshzoo/manpage-colorizer
zshzoo/termtitle
zshzoo/iwd
zshzoo/up
zshzoo/macos
zshzoo/common-aliases
zshzoo/zfunctions
zshzoo/zshrc.d

# prompt
sindresorhus/pure

# other great plugins
rummik/zsh-tailf
rupa/z
zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search
#zsh-users/zsh-syntax-highlighting
zshzoo/compinit
zdharma-continuum/fast-syntax-highlighting
