# zephyr can do the whole thing
mattmc3/zephyr path:plugins/editor
mattmc3/zephyr path:plugins/history
mattmc3/zephyr path:plugins/utility
mattmc3/zephyr path:plugins/directory
mattmc3/zephyr path:plugins/macos
mattmc3/zephyr path:plugins/brew
mattmc3/zephyr path:plugins/color
mattmc3/zephyr path:plugins/clipboard
mattmc3/zephyr path:plugins/syntax-highlighting
mattmc3/zephyr path:plugins/zman
mattmc3/zephyr path:plugins/z
mattmc3/zephyr path:plugins/prompt
mattmc3/zephyr path:plugins/completion
mattmc3/zephyr path:plugins/autosuggest
mattmc3/zephyr path:plugins/history-substring-search

# vim: ft=zsh sw=2 ts=2 et
